Revit 2015 API
AreaLoadTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual AreaLoadTypeSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As AreaLoadTypeSetIterator
Visual C++
public:
virtual AreaLoadTypeSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
AreaLoadTypeSet Class
Autodesk.Revit.DB.Structure Namespace